CF/Catalogs/ВариантыРаспределенияТоваров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Catalog>
		<Properties>
			<Name>ВариантыРаспределенияТоваров</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ИспользоватьПриОтгрузке</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьПриПоступлении</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВнешняяОбработка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДополнительныеОтчетыИОбработки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИндивидуальныеНастройкиДляМагазинов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CF/InformationRegisters/НастройкиВариантовРаспределенияТоваров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>НастройкиВариантовРаспределенияТоваров</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>НастройкиВарианта</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПрименятьАвтоматически</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ВариантРаспределенияТоваров</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВариантыРаспределенияТоваров</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Магазин</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Магазины</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

CF/Catalogs/Склады.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Catalog>
		<Properties>
			<Name>Склады</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТипСклада</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыСкладов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Магазин</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Магазины</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Пользователи</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Пользователь</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Comment>Свойство</Comment>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Comment>Значение</Comment>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CF/Catalogs/ВариантыРаспределенияТоваров/Forms/ФормаНастройкиРаспределенияПоОстаткам/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("Магазин") Тогда
		Магазин = Параметры.Магазин;
	Иначе
		Отказ = Истина;
	КонецЕсли;
	
	Если Параметры.Свойство("СохранениеНастроек") Тогда
		Элементы.ОткрыватьНастройкиПередРаспределением.Видимость = Параметры.СохранениеНастроек;
	Иначе
		Элементы.ОткрыватьНастройкиПередРаспределением.Видимость = Ложь;
	КонецЕсли;
	
	Если Параметры.Свойство("ЗаголовокОсновнойКнопки") Тогда
		Элементы.ФормаСохранитьИЗакрыть.Заголовок = Параметры.ЗаголовокОсновнойКнопки;
	КонецЕсли;
	
	ВариантРаспределенияТоваров = Справочники.ВариантыРаспределенияТоваров.ПриОтгрузкеПоОстаткам;
	
	Запрос = Новый Запрос();
	Запрос.Текст = 
	"Выбрать НастройкиВарианта, ПрименятьАвтоматически
	|Из РегистрСведений.НастройкиВариантовРаспределенияТоваров как Настройки
	|Где ВариантРаспределенияТоваров = &ВариантРаспределенияТоваров и Магазин = &Магазин";
	Запрос.УстановитьПараметр("ВариантРаспределенияТоваров", ВариантРаспределенияТоваров);
	Запрос.УстановитьПараметр("Магазин", Магазин);
	Результат = Запрос.Выполнить().Выбрать();
	
	Если Результат.Следующий() Тогда
		ОткрыватьНастройкиПередРаспределением = не Результат.ПрименятьАвтоматически;
		НастройкиВарианта.Загрузить(Результат.НастройкиВарианта.Получить());
	КонецЕсли;
	
	ИспользованныеСклады = Новый Массив();
	Для Каждого Строка Из НастройкиВарианта Цикл
		ИспользованныеСклады.Добавить(Строка.Склад);
	КонецЦикла;
	
	Запрос = Новый Запрос();
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Склады.Ссылка КАК Склад
	|ИЗ
	|	Справочник.Склады КАК Склады
	|ГДЕ
	|	Склады.Магазин = &Магазин
	|	И НЕ Склады.Ссылка В (&ИспользованныеСклады)
	|	И НЕ Склады.ПометкаУдаления";
	Запрос.УстановитьПараметр("Магазин", Магазин);
	Запрос.УстановитьПараметр("ИспользованныеСклады", ИспользованныеСклады);
	Результат = Запрос.Выполнить().Выбрать();
	
	Пока Результат.Следующий() Цикл
		НовСтр = НастройкиВарианта.Добавить();
		НовСтр.Склад = Результат.Склад;
	КонецЦикла;
		
КонецПроцедуры

&НаКлиенте
Процедура СохранитьИЗакрыть(Команда)
	
	Если ЭтаФорма.ПроверитьЗаполнение() Тогда
		Закрыть(СтруктураВозвратаФормы());
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	
	Закрыть(Неопределено);
	
КонецПроцедуры

&НаСервере
Функция СтруктураВозвратаФормы()
	
	СтруктураРезультат = Новый Структура();
	СтруктураРезультат.Вставить("НастройкиВарианта", Новый ХранилищеЗначения(НастройкиВарианта.Выгрузить()));
	СтруктураРезультат.Вставить("ПрименятьАвтоматически", не ОткрыватьНастройкиПередРаспределением);
	
	Возврат СтруктураРезультат;
	
КонецФункции
